{
  "website":{
    "title": "Philipp S. Sommer"
  },
  "nav":{
    "home": "Home",
    "about_me": "About",
    "skills": "Skills",
    "projects": "Projects",
    "career": "Career",
    "blog": "Blog",
    "link": "Link",
    "bibliography": "Publications"
  },
  "about_me":{
    "about_me": "About Me",
    "des": "Research Software Engineering for climate science"
  },
  "skills":{
    "my_skills": "My Skills"
  },
  "projects":{
    "my_projects": "My Projects",

    "hornet": "Holocene Climate Reconstruction for the Northern Hemisphere Extra-tropics",
    "hornet_desc": "A key scientific objective of this SNF funded project is using data to identify the relative contribution of the summer and winter seasons to Northern Hemisphere interglacial warming, and particularly the relative role of an orbitally driven increase in insolation in summer, and a dynamically driven increase in the pole-ward heat flux in winter. We investigate the role of atmospheric dynamics by comparison with comparable patterns of regional climate anomalies generated by modern analogue circulation patterns. The project will make available a high quality gridded and seasonally resolved reconstruction of Northern Hemisphere climate change during the Holocene that will provide a state-of-the-art baseline for climate model evaluation, and particularly to evaluate the ability of models to reproduce regional climate change, which remains a key uncertainty in simulations of future climate change.",

    "psyplot": "Python framework for interactive data visualization",
    "psyplot_desc": "psyplot is a cross-platform open source python project that mainly combines the plotting utilities of matplotlib and the data management of the xarray package and integrates them into a software that can be used via command-line and via a GUI. <br> The main purpose is to have a framework that allows a fast, attractive, flexible, easily applicable, easily reproducible and especially an interactive visualization and analysis of data. <br> Through various plugins psyplot visualizes georeferenced climate model data on rectangular and unstructured grids, regressions, stratigraphic diagrams and more. <br> Examples are available at <a href=https://psyplot.readthedocs.io/en/latest/#examples>psyplot.readthedocs.io</a>.",

    "straditize": "A software for a semi-automatic digitization of pollen diagrams or other types of stratigraphic diagrams using the command line or a graphical user interface.",
    "straditize_desc": "STRADITIZE (Stratigraphic Diagram Digitizer) is an open-source program that allows stratigraphic figures to be digitized in a single semi-automated operation. It is designed to detect multiple plots of variables analyzed along the same vertical axis, whether this is a sediment core or any similar depth/time series. <br> More at <a href=https://straditize.readthedocs.io>straditize.readthedocs.io</a>.",

    "empd": "The Eurasian Modern Pollen Database",

    "my_side_projects": "Side Projects",

    "gwgen": "A global weather generator for daily data",
    "gwgen_desc": "This synthesis of FORTRAN and Python is a globally applicable weather generator parameterized through a global dataset of weather station data with more than 50 million individual daily records. It downscales wind speed, precipitation, temperature, and cloud cover from monthly to daily resolution. <br> More at <a href='https://arve-research.github.io/gwgen/'>arve-research.gihub.io/gwgen</a>",

    "iucm": "A model to simulate urban growth and transformation with the objective of minimising the energy required for transportation.",
    "iucm_desc": "The Integrated Urban Complexity model (IUCm) is a relatively simple probablistic computational model to compute 'climate-smart urban forms', that cut down emissions related to energy consumption from urban mobility. <br> More at <a href='https://iucm.readthedocs.io'>iucm.readthedocs.io</a>",

    "docrep": "Python package for docstring repetition",
    "docrep_desc": "The documentation repetition module (docrep) targets developpers that develop complex and nested Python APIs and helps them to create a well-documented software. <br> More at <a href='https://docrep.readthedocs.io'>docrep.readthedocs.io</a>",

    "sphinx-nbexamples": "Include Jupyter notebooks in a sphinx documentation",
    "sphinx-nbexamples_desc": "This python package creates an example gallery for documentations generated by pythons sphinx package out of a bunch of jupyter notebooks. <br> More examples at <a href='https://sphinx-nbexamples.readthedocs.io'>sphinx-nbexamples.readthedocs.io</a>",

    "model-organization": "Python package for a transparent organization of computational models",
    "funcargparse": "Python package to create command line parsers from docstrings"
  },
  "career":{
    "description": "During my Bachelor I realized that I really want to do research on how our world is evolving. This wish was even stronger than my joy about the beauty of maths in physics. I have strong theoretical skills so I started coding and to develop climate models. This is now the way to go for me and since then I rejoice in data analysis and visualization. We can extract so much new knowledge out of these large data sets through visual and statistical exploration. Hence I am always keen to learn and develop new techniques and to share them with others.",
    "my_career": "My Career",
    "PhD": "PhD",
    "PhD_desc": "Institute of Earth Surface Dynamics (IDYST)",
    "PhD_date": "Dec. 2015",
    "PhD_job": "PhD student",
    "MSc": "Max-Planck-Institute for Meteorology/University of Hamburg",
    "MSc_desc": "Master of Integrated Climate System Sciences",
    "MSc_date": "Sep. 2013",
    "MSc_job": "Master student",
    "GP": "Greenpeace Germany e.V.",
    "GP_desc": "Biodiversity and Climate team",
    "GP_date": "Sep. 2012",
    "GP_job": "Intern",
    "BSc": "University of Heidelberg",
    "BSc_desc": "Bachelor of Physics",
    "BSc_date": "Sep. 2009",
    "BSc_job": "Bachelor student"
  },
  "bibliography":{
    "my_bib": "Publications",
    "my_papers": "Peer-reviewed",
    "my_conferences": "Conference contributions"
  },
  "blog":{
    "my_blog": "My Blog"
  },
  "link":{
    "link": "Link",
    "view": "views"
  }
}
